[net]
batch=55
subdivisions=5
width=480   
height=480
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.2

#learning_rate=0.001
#burn_in=1000
#max_batches = 500000
#policy=steps
#steps  = 400000, 450000
#scales =     .1,     .1

#learning_rate=0.001
#max_batches = 550000
#policy=steps
#steps  = -1,  50, 200000, 400000, 500000
#scales = .1,  10,     .1,     .1,     .1

#learning_rate=0.001
#max_batches = 550000
#burn_in=1000
#policy=steps
#steps  = 200000, 400000, 500000
#scales =     .1,     .1,     .1

########################################################
# Fine Tuning Tiny following YOLO9000 Paper
# parameters valid for batch=64 and ts_size=5432

learning_rate=0.001
#burn_in=850
# Train 500 epochs
max_batches = 50000
policy = steps
steps  =   -1, 500, 1000, 1500, 3500, 13500, 33500    
scales = 0.01,  10,   10,   10,  0.1,   0.1,   0.1
########################################################

[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=1

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

###########

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=35
activation=linear

[region]
anchors =  0.57273, 0.677385, 1.87446, 2.06253, 3.33843, 5.47434, 7.88282, 3.52778, 9.77052, 9.16828
bias_match=1
classes=2
coords=4
num=5
softmax=1
jitter=.2
rescore=0

object_scale=5
noobject_scale=1
class_scale=1
coord_scale=1

absolute=1
thresh = .6
#random = 1
random = 1
